In [177]:
# Dependencies
import pandas as pd
import numpy as np

In [178]:
# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

In [179]:
purchase_data_df = pd.read_csv(file_to_load)
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [4]:
# Players Count

In [5]:
unique_df = purchase_data_df["SN"].unique()
lenght_df = len(unique_df)
lenght_df

576

In [6]:
# Finding the value count  of "SN" column 
total_players_df = purchase_data_df["SN"].value_counts()
total_players_df

Lisosia93      5
Idastidru52    4
Iral74         4
Iri67          3
Lisim78        3
              ..
Alaesu91       1
Jiskimsda56    1
Ermol76        1
Chamastya76    1
Eusur90        1
Name: SN, Length: 576, dtype: int64

In [7]:
output_list = [{"Total_Players": len(total_players_df)}]
output1_df = pd.DataFrame(output_list)
output1_df

   Total_Players
0            576

In [8]:
Total_Players = len(total_players_df)
Total_Players

576

In [9]:
pd.crosstab(purchase_data_df["SN"], purchase_data_df["Gender"])

Gender         Female  Male  Other / Non-Disclosed
SN
Adairialis76        0     1                      0
Adastirin33         1     0                      0
Aeda94              0     1                      0
Aela59              0     1                      0
Aelaria33           0     1                      0
...               ...   ...                    ...
Yathecal82          3     0                      0
Yathedeu43          0     2                      0
Yoishirrala98       1     0                      0
Zhisrisu83          0     2                      0
Zontibe81           0     3                      0

[576 rows x 3 columns]

In [10]:
total_count = len(pd.crosstab(purchase_data_df["SN"], purchase_data_df["Gender"]))
total_count

576

In [11]:
# Gender Demographics

In [12]:
unique_genders = purchase_data_df.groupby(["Gender"])["SN"].nunique()
unique_genders

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [13]:
unique_female_count = unique_genders["Female"]
unique_female_count

81

In [14]:
unique_male_count = unique_genders["Male"]
unique_male_count

484

In [15]:
unique_others_count = unique_genders["Other / Non-Disclosed"]
unique_others_count

11

In [16]:
summary_output3 = [{" ": "Male", "Total Count": unique_male_count, "Percentage of Players": ((unique_male_count / total_count)*100) },
             {" ": "Female", "Total Count": unique_female_count, "Percentage of Players": ((unique_female_count / total_count)*100) },
{" ": "Other / Non-Disclosed", "Total Count": unique_others_count, "Percentage of Players": ((unique_others_count / total_count)*100) }]
output3_df = pd.DataFrame(summary_output3)
output3_df

                          Total Count  Percentage of Players
0                   Male          484              84.027778
1                 Female           81              14.062500
2  Other / Non-Disclosed           11               1.909722

In [17]:
# Use Map to format all the columns
output3_df["Percentage of Players"] = output3_df["Percentage of Players"].map("{:.2f}%".format)
output3_df

                          Total Count Percentage of Players
0                   Male          484                84.03%
1                 Female           81                14.06%
2  Other / Non-Disclosed           11                 1.91%

In [18]:
count = purchase_data_df["Gender"].value_counts()
count

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [19]:
# Purchasing Analysis(Total)

In [20]:
# The unique method shows every element of the series that appears only once
unique_items = len(purchase_data_df["Item ID"].unique())
unique_items

179

In [21]:
# Create a new dataframe of the of the group of unique items
item_group = purchase_data_df.groupby(["Item ID"])
unique_item = item_group.sum()
unique_item

         Purchase ID  Age  Price
Item ID
0               1149   74   5.12
1               1523   89  11.77
2               2006  143  14.88
3               2087  155  14.94
4               1885  124   8.50
...              ...  ...    ...
178             4960  287  50.76
179             1948  126  26.88
181             1278  109   8.30
182             1327   67  12.09
183             1488   66   3.27

[179 rows x 3 columns]

In [22]:
num_unique_items = len(unique_item)
num_unique_items

179

In [23]:
average = purchase_data_df["Price"].mean()
average

3.0509871794871795

In [24]:
average_price = round(average, 2)
average_price

3.05

In [25]:
num_purchases = len(purchase_data_df["Purchase ID"])
num_purchases

780

In [26]:
total_revenue = (purchase_data_df["Price"]).sum()
total_revenue

2379.77

In [27]:
summary_output = [{"Number of Unique Items": num_unique_items, "Average Price": average, 
                   "Number of Purchases": num_purchases, "Total Revenue": total_revenue }]
output2_df = pd.DataFrame(summary_output)
output2_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [28]:
output2_df.dtypes

Number of Unique Items      int64
Average Price             float64
Number of Purchases         int64
Total Revenue             float64
dtype: object

In [29]:
# Use Map to format all the columns
output2_df["Average Price"] = output2_df["Average Price"].map("${:.2f}".format)
output2_df["Total Revenue"] = output2_df["Total Revenue"].map("${:,}".format)
output2_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

In [30]:
output2_df.dtypes

Number of Unique Items     int64
Average Price             object
Number of Purchases        int64
Total Revenue             object
dtype: object

In [31]:
# Purchasing Analysis (Gender)

In [32]:
# Collecting a list of all columns within the DataFrame
purchase_data_df.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [33]:
#create a new table that takes these
gender_df= purchase_data_df[["Item ID","Gender", "Price"]]
gender_df

     Item ID  Gender  Price
0        108    Male   3.53
1        143    Male   1.56
2         92    Male   4.88
3        100    Male   3.27
4        131    Male   1.44
..       ...     ...    ...
775       60  Female   3.54
776      164    Male   1.63
777       67    Male   3.46
778       92    Male   4.19
779       50    Male   4.60

[780 rows x 3 columns]

In [34]:
lock_df = purchase_data_df.loc[purchase_data_df["Gender"] == "Male", ["Item ID", "Gender", "Price"]]
lock_df

     Item ID Gender  Price
0        108   Male   3.53
1        143   Male   1.56
2         92   Male   4.88
3        100   Male   3.27
4        131   Male   1.44
..       ...    ...    ...
774       92   Male   4.19
776      164   Male   1.63
777       67   Male   3.46
778       92   Male   4.19
779       50   Male   4.60

[652 rows x 3 columns]

In [35]:
lock_df = purchase_data_df.loc[purchase_data_df["Gender"] == "Female", ["Item ID", "Gender", "Price"]]
lock_df

     Item ID  Gender  Price
15        98  Female   2.89
18        82  Female   4.90
38       116  Female   4.18
41         7  Female   1.33
55        84  Female   3.79
..       ...     ...    ...
731       12  Female   1.02
740      127  Female   3.92
754       79  Female   4.05
767       92  Female   4.88
775       60  Female   3.54

[113 rows x 3 columns]

In [36]:
lock_df = purchase_data_df.loc[purchase_data_df["Gender"] == "Other / Non-Disclosed", ["Item ID", "Gender", "Price"]]
lock_df

     Item ID                 Gender  Price
9        136  Other / Non-Disclosed   3.58
22        24  Other / Non-Disclosed   3.81
82       160  Other / Non-Disclosed   4.40
111       41  Other / Non-Disclosed   4.75
228       80  Other / Non-Disclosed   3.39
237       16  Other / Non-Disclosed   3.55
242       39  Other / Non-Disclosed   3.94
291       35  Other / Non-Disclosed   3.45
350       34  Other / Non-Disclosed   2.22
401       46  Other / Non-Disclosed   1.33
484       39  Other / Non-Disclosed   3.94
549      146  Other / Non-Disclosed   3.10
629      107  Other / Non-Disclosed   2.18
637      163  Other / Non-Disclosed   3.45
747      146  Other / Non-Disclosed   3.10

In [37]:
avg_total_purchase = lock_df.groupby(["Gender"])
price_df= avg_total_purchase.sum()
price_df

                       Item ID  Price
Gender
Other / Non-Disclosed     1212  50.19

In [38]:
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [39]:
purchase = gender_df.groupby(["Gender"])
price_df1= purchase.count()
price_df1

                       Item ID  Price
Gender
Female                     113    113
Male                       652    652
Other / Non-Disclosed       15     15

In [40]:
# Reading the cell values
purchase_count_female = price_df1.iloc[0, -1]
purchase_count_female

113

In [41]:
purchase_count_male = price_df1.iloc[1, -1]
purchase_count_male

652

In [42]:
purchase_count_others = price_df1.iloc[2, -1]
purchase_count_others

15

In [43]:
total_purchase = gender_df.groupby(["Gender"])
price_df1= total_purchase.sum()
price_df1

                       Item ID    Price
Gender
Female                    9659   361.94
Male                     60698  1967.64
Other / Non-Disclosed     1212    50.19

In [44]:
# Reading the cell values
total_purchase_female = price_df1.iloc[0, -1]
total_purchase_female

361.93999999999966

In [45]:
total_purchase_male = price_df1.iloc[1, -1]
total_purchase_male

1967.6399999999994

In [46]:
total_purchase_others = price_df1.iloc[2, -1]
total_purchase_others

50.190000000000005

In [47]:
avg_purchase = gender_df.groupby(["Gender"])
price_df2= avg_purchase.mean()
price_df2

                         Item ID     Price
Gender
Female                 85.477876  3.203009
Male                   93.095092  3.017853
Other / Non-Disclosed  80.800000  3.346000

In [48]:
Avg_purchase_price_female = price_df2.iloc[0, -1]
Avg_purchase_price_female

3.203008849557519

In [49]:
Avg_purchase_price_male = price_df2.iloc[1, -1]
Avg_purchase_price_male

3.0178527607361953

In [50]:
Avg_purchase_price_others = price_df2.iloc[2, -1]
Avg_purchase_price_others

3.3460000000000005

In [51]:
unique_female_count = unique_genders["Female"]
unique_female_count

81

In [52]:
unique_male_count = unique_genders["Male"] 
unique_male_count

484

In [53]:
unique_others_count = unique_genders["Other / Non-Disclosed"]
unique_others_count

11

In [54]:
summary_output4 = [{" ": "Female", "Purchase Count": purchase_count_female, "Average Purchase Price": Avg_purchase_price_female, "Total Purchase Value": total_purchase_female, "Avg Total Puchase per Person": (total_purchase_female / unique_female_count)},
             {" ": "Male", "Purchase Count": purchase_count_male, "Average Purchase Price": Avg_purchase_price_male, "Total Purchase Value": total_purchase_male, "Avg Total Puchase per Person": (total_purchase_male / unique_male_count)},
{" ": "Other / Non-Disclosed", "Purchase Count": purchase_count_others, "Average Purchase Price": Avg_purchase_price_others, "Total Purchase Value": total_purchase_others, "Avg Total Puchase per Person": (total_purchase_others / unique_others_count)}]
output4_df = pd.DataFrame(summary_output4)
output4_df

,,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Puchase per Person
0,Female,113,3.203009,361.94,4.468395
1,Male,652,3.017853,1967.64,4.065372
2,Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [55]:
# Use Map to format all the columns
output4_df["Average Purchase Price"] = output4_df["Average Purchase Price"].map("${:.2f}".format)
output4_df["Total Purchase Value"] = output4_df["Total Purchase Value"].map("${:,.2f}".format)
output4_df["Avg Total Puchase per Person"] = output4_df["Avg Total Puchase per Person"].map("${:.2f}".format)
output4_df

,,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Puchase per Person
0,Female,113,$3.20,$361.94,$4.47
1,Male,652,$3.02,"$1,967.64",$4.07
2,Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [56]:
# Age Demographics

In [57]:
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [58]:
df = purchase_data_df["Age"].max()
df

45

In [59]:
df = purchase_data_df["Age"].min()
df

7

In [60]:
# sorting this dataframe by age

In [61]:
purchase_data_copy_df = purchase_data_df

In [62]:
# Create the bins in which Data will be held
bins = [7, 9, 14, 19, 24, 29, 34, 39, 45]

In [63]:
# Create the names for the five bins
bin_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39","40+"]
bin_names

['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+']

In [64]:
purchase_data_copy_df["Age Bins"]= pd.cut(purchase_data_copy_df["Age"], bins, labels = bin_names, include_lowest=True)
purchase_data_copy_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Bins
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [65]:
# Create a GroupBy object based upon "Age Bins"
bin_df = purchase_data_copy_df.groupby("Age Bins")
bin_df = bin_df.count()
bin_df

          Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Age Bins
<10                23   23   23      23       23         23     23
10-14              28   28   28      28       28         28     28
15-19             136  136  136     136      136        136    136
20-24             365  365  365     365      365        365    365
25-29             101  101  101     101      101        101    101
30-34              73   73   73      73       73         73     73
35-39              41   41   41      41       41         41     41
40+                13   13   13      13       13         13     13

In [66]:
# Calculations for age bin "< 10"

In [67]:
lock_df1 = purchase_data_copy_df.loc[(purchase_data_df["Age Bins"]  == "<10"), ["Age", "SN", "Price"]]
lock_df1

     Age             SN  Price
27     7        Eusri44   3.09
33     7   Haillyrgue51   2.38
37     8      Seuthep89   2.05
78     7   Haillyrgue51   4.60
81     8       Heudai45   3.47
187    8     Tyeurith29   3.65
272    8   Anallorgue57   4.09
311    8   Anallorgue57   1.61
339    8        Ilmol66   1.29
446    7   Chanossast57   4.32
481    7     Sondossa69   4.48
486    9   Eurithphos97   2.05
515    7   Haillyrgue51   2.52
546    9     Sondadar26   3.08
575    9     Sondadar26   3.39
610    7  Frichossala54   3.08
658    7     Quilassa66   4.23
672    9      Ililsan66   2.85
686    8     Chadjask77   4.93
692    9    Quaecjask96   4.40
732    9   Eurithphos97   2.50
767    8        Ilmol66   4.88
778    7        Sisur91   4.19

In [68]:
unique_players_count1 = lock_df1["SN"].unique()
unique_players_count1 = len(unique_players_count1)
unique_players_count1

17

In [69]:
count1 = lock_df1["SN"].count()
count1

23

In [70]:
total_price1 = lock_df1["Price"].sum()
total_price1

77.13

In [71]:
avg_price1 = lock_df1["Price"].mean()
avg_price1

3.353478260869565

In [72]:
summary1 = lock_df1["Price"].describe()
summary1

count    23.000000
mean      3.353478
std       1.072811
min       1.290000
25%       2.510000
50%       3.390000
75%       4.275000
max       4.930000
Name: Price, dtype: float64

In [73]:
total_count = 576      # as calculated above
percentage_of_players1 = (unique_players_count1 / total_count) * 100
percentage_of_players1

2.951388888888889

In [74]:
# Calculations for age bin "10-14"

In [75]:
lock_df2 = purchase_data_copy_df.loc[(purchase_data_df["Age Bins"]  == "10-14"), ["Age", "SN", "Price"]]
lock_df2

     Age             SN  Price
26    11     Lirtossa84   1.61
32    10     Aeralria27   4.09
38    10       Reulae52   4.18
54    10     Zhisrisu83   4.35
56    12       Raesty92   3.53
76    13   Mindadaran26   3.75
139   13       Lisasi93   2.45
141   10     Zhisrisu83   3.54
155   10     Aillyrin83   2.89
163   11        Sidap51   4.24
292   13       Lisasi93   1.03
299   11     Lirtossa84   1.63
394   12  Lassassasda30   3.54
408   12       Raesty92   2.05
411   10       Lisico81   4.19
413   12        Siana77   1.97
424   10      Iarilis73   1.75
449   13   Ethralista69   2.22
487   14    Raillydeu47   1.97
493   14  Chanirrasta87   4.94
531   12     Lirtirra81   1.56
534   10         Iana95   3.10
539   11     Eosurdru76   1.79
601   11    Ilastilis78   1.97
679   10      Iarilis73   3.74
751   11    Lisjaskan36   3.36
755   12       Raesty92   3.15
774   11     Jiskjask80   4.19

In [76]:
unique_players_count2 = lock_df2["SN"].unique()
unique_players_count2 = len(unique_players_count2)
unique_players_count2

22

In [77]:
total_count = 576      # as calculated above
percentage_of_players2 = (unique_players_count2 / total_count) * 100
percentage_of_players2

3.8194444444444446

In [78]:
# Calculations for age bin "15-19"

In [79]:
lock_df3 = purchase_data_copy_df.loc[(purchase_data_df["Age Bins"]  == "15-19"), ["Age", "SN", "Price"]]
lock_df3

     Age             SN  Price
30    19         Idai61   2.94
34    19       Sondim73   4.40
42    18  Aidaillodeu39   3.77
59    19       Yaliru88   3.03
61    17     Jiskimya77   4.23
..   ...            ...    ...
757   18      Eratiel90   4.60
764   18   Saedaiphos46   4.07
765   18        Irith83   2.07
769   15      Ilosian36   4.58
771   16   Iskossasda43   4.35

[136 rows x 3 columns]

In [80]:
unique_players_count3 = lock_df3["SN"].unique()
unique_players_count3 = len(unique_players_count3)
unique_players_count3

107

In [81]:
total_count = 576      # as calculated above
percentage_of_players3 = (unique_players_count3 / total_count) * 100
percentage_of_players3

18.57638888888889

In [82]:
# Calculations for age bin "20-24"

In [83]:
lock_df4 = purchase_data_copy_df.loc[(purchase_data_df["Age Bins"]  == "20-24"), ["Age", "SN", "Price"]]
lock_df4

     Age             SN  Price
0     20        Lisim78   3.53
2     24     Ithergue48   4.88
3     24  Chamassasya86   3.27
4     23      Iskosia90   1.44
5     22        Yalae81   3.61
..   ...            ...    ...
773   21         Hala31   1.02
775   21     Aethedru70   3.54
776   21         Iral74   1.63
777   20     Yathecal72   3.46
779   24      Ennrian78   4.60

[365 rows x 3 columns]

In [84]:
unique_players_count4 = lock_df4["SN"].unique()
unique_players_count4 = len(unique_players_count4)
unique_players_count4

258

In [85]:
total_count = 576      # as calculated above
percentage_of_players4 = (unique_players_count4 / total_count) * 100
percentage_of_players4

44.79166666666667

In [86]:
# Calculations for age bin "25-29"

In [87]:
lock_df5 = purchase_data_copy_df.loc[(purchase_data_df["Age Bins"]  == "25-29"), ["Age", "SN", "Price"]]
lock_df5

     Age            SN  Price
25    29     Lisirra87   4.23
46    27     Yasrisu92   3.44
55    25     Phaelap26   3.79
65    25  Chamirraya83   2.22
70    29     Pheodai94   1.56
..   ...           ...    ...
724   25  Lisassasta50   1.94
734   25        Arin32   4.86
759   25   Tyaelorap29   3.77
762   26        Asur53   1.44
772   26        Asur53   3.58

[101 rows x 3 columns]

In [88]:
unique_players_count5 = lock_df5["SN"].unique()
unique_players_count5 = len(unique_players_count5)
unique_players_count5

77

In [89]:
total_count = 576      # as calculated above
percentage_of_players5 = (unique_players_count5 / total_count) * 100
percentage_of_players5

13.368055555555555

In [90]:
# Calculations for age bin "30-34"

In [91]:
lock_df6 = purchase_data_copy_df.loc[(purchase_data_df["Age Bins"]  == "30-34"), ["Age", "SN", "Price"]]
lock_df6

     Age            SN  Price
19    30     Chamalo71   4.64
24    30       Siala43   3.19
36    30    Idaisuir85   3.15
49    33   Iaralrgue74   1.44
53    32   Ilosianya35   2.84
..   ...           ...    ...
698   30   Yarithrin84   4.14
700   31    Chanosia60   2.94
717   30  Chanilsast61   2.08
730   30     Aidaira26   4.23
770   34    Lirtosia63   1.02

[73 rows x 3 columns]

In [92]:
unique_players_count6 = lock_df6["SN"].unique()
unique_players_count6 = len(unique_players_count6)
unique_players_count6

52

In [93]:
total_count = 576      # as calculated above
percentage_of_players6 = (unique_players_count6 / total_count) * 100
percentage_of_players6

9.027777777777777

In [94]:
# Calculations for age bin "35-39"

In [95]:
lock_df7 = purchase_data_copy_df.loc[(purchase_data_df["Age Bins"]  == "35-39"), ["Age", "SN", "Price"]]
lock_df7

     Age              SN  Price
6     36       Itheria73   2.18
9     35     Chanosian48   3.58
14    35     Saesrideu94   4.86
22    38    Siarithria38   3.81
31    37     Farusrian86   4.48
107   36      Tyaerith73   1.71
127   37    Lisossanya98   3.44
142   35     Adastirin33   4.48
147   35     Hailaphos89   3.81
182   38         Lamil79   4.40
195   39       Minduri31   4.07
196   35     Maradaran90   2.73
202   37       Phistym51   4.90
208   37     Qilanrion65   3.03
217   38       Cosadar58   4.35
252   39        Tyaelo67   4.88
264   35     Saesrideu94   4.32
270   38    Assassasta79   1.75
294   37     Ilirrasda54   1.79
372   35    Saistyphos30   4.82
483   35    Saistyphos30   3.53
484   35     Chanosian48   3.94
498   35         Firon67   3.53
512   35      Sastydeu50   2.18
516   39        Aidain51   3.45
517   39  Aerithnuphos61   4.91
521   37       Phistym51   4.60
563   38          Isri34   2.62
648   39      Eustyria89   2.85
659   36    Lisassasda39   2.94
660   38          Isri34   4.35
687   35       Ealiril69   4.40
688   35    Saistyphos30   1.98
695   38         Lamil79   4.89
718   37     Ilirrasda54   3.27
738   36         Eusur90   1.60
739   35   Mindirranya33   3.87
745   39      Chanista95   3.16
747   38    Siarithria38   3.10
753   36  Frichirranya75   4.23
768   38    Assassasta79   4.88

In [96]:
unique_players_count7 = lock_df7["SN"].unique()
unique_players_count7 = len(unique_players_count7)
unique_players_count7

31

In [97]:
total_count = 576      # as calculated above
percentage_of_players7 = (unique_players_count7 / total_count) * 100
percentage_of_players7

5.381944444444445

In [98]:
# Calculations for age bin "40+"

In [99]:
lock_df8 = purchase_data_copy_df.loc[(purchase_data_df["Age Bins"]  == "40+"), ["Age", "SN", "Price"]]
lock_df8

     Age            SN  Price
1     40   Lisovynya38   1.56
23    40      Eyrian71   3.40
156   40      Eyrian71   1.79
220   40    Jiskjask85   1.33
248   44    Isursuir31   3.39
341   41   Hiasurria41   1.61
477   41    Mindossa76   4.93
480   40     Salilis27   4.23
557   42    Frichaya88   3.93
667   40     Inasuir29   4.40
674   43       Aeral68   4.00
728   44  Chanosiaya39   1.97
761   45       Assim27   1.70

In [100]:
unique_players_count8 = lock_df8["SN"].unique()
unique_players_count8 = len(unique_players_count8)
unique_players_count8

12

In [101]:
total_count = 576      # as calculated above
percentage_of_players8 = (unique_players_count8 / total_count) * 100
percentage_of_players8

2.083333333333333

In [102]:
summary_output5 = [{" ": "<10","Total Count": unique_players_count1, "Percentage of Players": percentage_of_players1}, 
                   {" ": "10-14","Total Count": unique_players_count2, "Percentage of Players": percentage_of_players2}, 
                   {" ": "15-19","Total Count": unique_players_count3, "Percentage of Players": percentage_of_players3}, 
                   {" ": "20-24","Total Count": unique_players_count4, "Percentage of Players": percentage_of_players4},
                   {" ": "25-29","Total Count": unique_players_count5, "Percentage of Players": percentage_of_players5}, 
                   {" ": "30-34","Total Count": unique_players_count6, "Percentage of Players": percentage_of_players6}, 
                   {" ": "35-39","Total Count": unique_players_count7, "Percentage of Players": percentage_of_players7}, 
                   {" ": "40+","Total Count": unique_players_count8, "Percentage of Players": percentage_of_players8,                   
                   }]
output5_df = pd.DataFrame(summary_output5)
output5_df

          Total Count  Percentage of Players
0    <10           17               2.951389
1  10-14           22               3.819444
2  15-19          107              18.576389
3  20-24          258              44.791667
4  25-29           77              13.368056
5  30-34           52               9.027778
6  35-39           31               5.381944
7    40+           12               2.083333

In [103]:
# Use Map to format all the columns
output5_df["Percentage of Players"] = output5_df["Percentage of Players"].map("${:.2f}%".format)
output5_df

          Total Count Percentage of Players
0    <10           17                $2.95%
1  10-14           22                $3.82%
2  15-19          107               $18.58%
3  20-24          258               $44.79%
4  25-29           77               $13.37%
5  30-34           52                $9.03%
6  35-39           31                $5.38%
7    40+           12                $2.08%

In [104]:
# Puchasing Analysis(Age)

In [105]:
purchase_data_copy_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Bins
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [106]:
# now grouping the bins and calculating the summary statistics
group_age_df = purchase_data_copy_df.groupby("Age Bins")

In [107]:
# calculating the average purchase price
price_df1 = group_age_df[["Price"]].mean()
price_df1

             Price
Age Bins
<10       3.353478
10-14     2.956429
15-19     3.035956
20-24     3.052219
25-29     2.900990
30-34     2.931507
35-39     3.601707
40+       2.941538

In [108]:
# Reading the cell values
avg_purchase_df1 = price_df1.iloc[0, -1]
avg_purchase_df1

3.353478260869565

In [109]:
avg_purchase_df2 = price_df1.iloc[1, -1]
avg_purchase_df2

2.956428571428571

In [110]:
avg_purchase_df3 = price_df1.iloc[2, -1]
avg_purchase_df3

3.03595588235294

In [111]:
avg_purchase_df4 = price_df1.iloc[3, -1]
avg_purchase_df4

3.0522191780821935

In [112]:
avg_purchase_df5 = price_df1.iloc[4, -1]
avg_purchase_df5

2.900990099009899

In [113]:
avg_purchase_df6 = price_df1.iloc[5, -1]
avg_purchase_df6

2.9315068493150687

In [114]:
avg_purchase_df7 = price_df1.iloc[6, -1]
avg_purchase_df7

3.6017073170731706

In [115]:
avg_purchase_df8 = price_df1.iloc[7, -1]
avg_purchase_df8

2.9415384615384617

In [116]:
# Calculating the purchase count
price_df2 = group_age_df[["Price"]].count()
price_df2

          Price
Age Bins
<10          23
10-14        28
15-19       136
20-24       365
25-29       101
30-34        73
35-39        41
40+          13

In [117]:
# Reading the cell values
purchase_count_df1 = price_df2.iloc[0, -1]
purchase_count_df1

23

In [118]:
purchase_count_df2 = price_df2.iloc[1, -1]
purchase_count_df2

28

In [119]:
purchase_count_df3 = price_df2.iloc[2, -1]
purchase_count_df3

136

In [120]:
purchase_count_df4 = price_df2.iloc[3, -1]
purchase_count_df4

365

In [121]:
purchase_count_df5 = price_df2.iloc[4, -1]
purchase_count_df5

101

In [122]:
purchase_count_df6 = price_df2.iloc[5, -1]
purchase_count_df6

73

In [123]:
purchase_count_df7 = price_df2.iloc[6, -1]
purchase_count_df7

41

In [124]:
purchase_count_df8 = price_df2.iloc[7, -1]
purchase_count_df8

13

In [125]:
# Calculating the total purchase value
price_df3 = group_age_df[["Price"]].sum()
price_df3

            Price
Age Bins
<10         77.13
10-14       82.78
15-19      412.89
20-24     1114.06
25-29      293.00
30-34      214.00
35-39      147.67
40+         38.24

In [126]:
# Reading the cell values
total_purchase_df1 = price_df3.iloc[0, -1]
total_purchase_df1

77.13

In [127]:
total_purchase_df2 = price_df3.iloc[1, -1]
total_purchase_df2

82.77999999999999

In [128]:
total_purchase_df3 = price_df3.iloc[2, -1]
total_purchase_df3

412.8899999999998

In [129]:
total_purchase_df4 = price_df3.iloc[3, -1]
total_purchase_df4

1114.0600000000006

In [130]:
total_purchase_df5 = price_df3.iloc[4, -1]
total_purchase_df5

292.99999999999983

In [131]:
total_purchase_df6 = price_df3.iloc[5, -1]
total_purchase_df6

214.0

In [132]:
total_purchase_df7 = price_df3.iloc[6, -1]
total_purchase_df7

147.67

In [133]:
total_purchase_df8 = price_df3.iloc[7, -1]
total_purchase_df8

38.24

In [134]:
summary_output6 = [{" ": "<10","Purchase Count": purchase_count_df1, "Average Purchase Price": avg_purchase_df1, "Total Purchase Value": total_purchase_df1, "Avg Total Purchase per Person": (total_purchase_df1 / unique_players_count1)},
                   {" ": "10-14","Purchase Count": purchase_count_df2, "Average Purchase Price": avg_purchase_df2, "Total Purchase Value": total_purchase_df2, "Avg Total Purchase per Person": (total_purchase_df2 / unique_players_count2)},
                   {" ": "15-19","Purchase Count": purchase_count_df3, "Average Purchase Price": avg_purchase_df3, "Total Purchase Value": total_purchase_df3, "Avg Total Purchase per Person": (total_purchase_df3 / unique_players_count3)},
                   {" ": "20-24","Purchase Count": purchase_count_df4, "Average Purchase Price": avg_purchase_df4, "Total Purchase Value": total_purchase_df4, "Avg Total Purchase per Person": (total_purchase_df4 / unique_players_count4)},
                   {" ": "25-29","Purchase Count": purchase_count_df5, "Average Purchase Price": avg_purchase_df5, "Total Purchase Value": total_purchase_df5, "Avg Total Purchase per Person": (total_purchase_df5 / unique_players_count5)},
                   {" ": "30-34","Purchase Count": purchase_count_df6, "Average Purchase Price": avg_purchase_df6, "Total Purchase Value": total_purchase_df6,  "Avg Total Purchase per Person": (total_purchase_df6 / unique_players_count6)}, 
                   {" ": "35-39","Purchase Count": purchase_count_df7, "Average Purchase Price": avg_purchase_df7, "Total Purchase Value": total_purchase_df7,  "Avg Total Purchase per Person": (total_purchase_df7 / unique_players_count7)},
                   {" ": "40+","Purchase Count": purchase_count_df8, "Average Purchase Price": avg_purchase_df8, "Total Purchase Value": total_purchase_df8, "Avg Total Purchase per Person": (total_purchase_df8 / unique_players_count8)
                   }]
output6_df = pd.DataFrame(summary_output6)
output6_df

,,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
0,<10,23,3.353478,77.13,4.537059
1,10-14,28,2.956429,82.78,3.762727
2,15-19,136,3.035956,412.89,3.858785
3,20-24,365,3.052219,1114.06,4.318062
4,25-29,101,2.900990,293.00,3.805195
5,30-34,73,2.931507,214.00,4.115385
6,35-39,41,3.601707,147.67,4.763548
7,40+,13,2.941538,38.24,3.186667

In [135]:
# Use Map to format all the columns
output6_df["Average Purchase Price"] = output6_df["Average Purchase Price"].map("${:.2f}".format)
output6_df["Total Purchase Value"] = output6_df["Total Purchase Value"].map("${:,.2f}".format)
output6_df["Avg Total Purchase per Person"] = output6_df["Avg Total Purchase per Person"].map("${:.2f}".format)
output6_df

,,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
0,<10,23,$3.35,$77.13,$4.54
1,10-14,28,$2.96,$82.78,$3.76
2,15-19,136,$3.04,$412.89,$3.86
3,20-24,365,$3.05,"$1,114.06",$4.32
4,25-29,101,$2.90,$293.00,$3.81
5,30-34,73,$2.93,$214.00,$4.12
6,35-39,41,$3.60,$147.67,$4.76
7,40+,13,$2.94,$38.24,$3.19

In [136]:
# Top Spenders

In [253]:
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [326]:
# Retrieve the "SN" and "Price" columns
purchase_data_df1 = purchase_data_df[["SN", "Price"]]
purchase_data_df1

                SN  Price
0          Lisim78   3.53
1      Lisovynya38   1.56
2       Ithergue48   4.88
3    Chamassasya86   3.27
4        Iskosia90   1.44
..             ...    ...
775     Aethedru70   3.54
776         Iral74   1.63
777     Yathecal72   3.46
778        Sisur91   4.19
779      Ennrian78   4.60

[780 rows x 2 columns]

In [327]:
grouped_df = purchase_data_df1.groupby('SN').sum()
grouped_df
#grouped.sort_values('Price', ascending=False)

               Price
SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
...              ...
Yathecal82      6.22
Yathedeu43      6.02
Yoishirrala98   4.58
Zhisrisu83      7.89
Zontibe81       8.03

[576 rows x 1 columns]

In [355]:
grouped_df = grouped_df.rename(columns={"Price": "Total Purchase Value"})
grouped_df

               Total Purchase Value
SN
Adairialis76                   2.28
Adastirin33                    4.48
Aeda94                         4.91
Aela59                         4.32
Aelaria33                      1.79
...                             ...
Yathecal82                     6.22
Yathedeu43                     6.02
Yoishirrala98                  4.58
Zhisrisu83                     7.89
Zontibe81                      8.03

[576 rows x 1 columns]

In [336]:
grouped2_df = purchase_data_df1.groupby('SN').mean()
grouped2_df
#grouped2.sort_values('Price', ascending=False)

                  Price
SN
Adairialis76   2.280000
Adastirin33    4.480000
Aeda94         4.910000
Aela59         4.320000
Aelaria33      1.790000
...                 ...
Yathecal82     2.073333
Yathedeu43     3.010000
Yoishirrala98  4.580000
Zhisrisu83     3.945000
Zontibe81      2.676667

[576 rows x 1 columns]

In [354]:
grouped2_df = grouped2_df.rename(columns={"Price": "Average Purchase Price"})
grouped2_df

               Average Purchase Price
SN
Adairialis76                 2.280000
Adastirin33                  4.480000
Aeda94                       4.910000
Aela59                       4.320000
Aelaria33                    1.790000
...                               ...
Yathecal82                   2.073333
Yathedeu43                   3.010000
Yoishirrala98                4.580000
Zhisrisu83                   3.945000
Zontibe81                    2.676667

[576 rows x 1 columns]

In [330]:
grouped1_df = purchase_data_df1.groupby('SN').count()
grouped1_df
#grouped2.sort_values('Price', ascending=False)

               Price
SN
Adairialis76       1
Adastirin33        1
Aeda94             1
Aela59             1
Aelaria33          1
...              ...
Yathecal82         3
Yathedeu43         2
Yoishirrala98      1
Zhisrisu83         2
Zontibe81          3

[576 rows x 1 columns]

In [356]:
grouped1_df = grouped1_df.rename(columns={"Price": "Purchase Count"})
grouped1_df

               Purchase Count
SN
Adairialis76                1
Adastirin33                 1
Aeda94                      1
Aela59                      1
Aelaria33                   1
...                       ...
Yathecal82                  3
Yathedeu43                  2
Yoishirrala98               1
Zhisrisu83                  2
Zontibe81                   3

[576 rows x 1 columns]

In [366]:
# Performing the inner merge
inner_merge_df = pd.merge(grouped_df, grouped1_df, on="SN")
inner_merge_df

               Total Purchase Value  Purchase Count
SN
Adairialis76                   2.28               1
Adastirin33                    4.48               1
Aeda94                         4.91               1
Aela59                         4.32               1
Aelaria33                      1.79               1
...                             ...             ...
Yathecal82                     6.22               3
Yathedeu43                     6.02               2
Yoishirrala98                  4.58               1
Zhisrisu83                     7.89               2
Zontibe81                      8.03               3

[576 rows x 2 columns]

In [367]:
# Performing the inner merge
inner_merge1_df = pd.merge(inner_merge_df, grouped2_df, on="SN")
inner_merge1_df

               Total Purchase Value  Purchase Count  Average Purchase Price
SN
Adairialis76                   2.28               1                2.280000
Adastirin33                    4.48               1                4.480000
Aeda94                         4.91               1                4.910000
Aela59                         4.32               1                4.320000
Aelaria33                      1.79               1                1.790000
...                             ...             ...                     ...
Yathecal82                     6.22               3                2.073333
Yathedeu43                     6.02               2                3.010000
Yoishirrala98                  4.58               1                4.580000
Zhisrisu83                     7.89               2                3.945000
Zontibe81                      8.03               3                2.676667

[576 rows x 3 columns]

In [369]:
# Sorting the values on column "Total Purchase Value" in the final dataframe
inner_merge1_df.sort_values('Total Purchase Value', ascending=False)

             Total Purchase Value  Purchase Count  Average Purchase Price
SN
Lisosia93                   18.96               5                3.792000
Idastidru52                 15.45               4                3.862500
Chamjask73                  13.83               3                4.610000
Iral74                      13.62               4                3.405000
Iskadarya95                 13.10               3                4.366667
...                           ...             ...                     ...
Ililsasya43                  1.02               1                1.020000
Irilis75                     1.02               1                1.020000
Aidai61                      1.01               1                1.010000
Chanirra79                   1.01               1                1.010000
Alo38                        1.00               1                1.000000

[576 rows x 3 columns]

In [ ]:
#Done

In [ ]:
# Reorganizing the columns using double brackets
#organized_df = training_df[["Name","Trainer","Weight","Membership(Days)"]]
#organized_df.head()

In [ ]:
# Most Popular Items

In [343]:
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [351]:
# Retrieve the "Item ID", "Item Name" and "Price" columns
Item_df = purchase_data_df[["Item ID", "Item Name", "Price"]]
Item_df

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
775       60                                       Wolf   3.54
776      164                           Exiled Doomblade   1.63
777       67      Celeste, Incarnation of the Corrupted   3.46
778       92                               Final Critic   4.19
779       50                                       Dawn   4.60

[780 rows x 3 columns]

In [357]:
# Performing groupby and count function first time and keeping in a seperate dataframe
Item_group1_df = Item_df.groupby(["Item ID", "Item Name"]).count()
Item_group1_df

                                                      Price
Item ID Item Name
0       Splinter                                          4
1       Crucifer                                          4
2       Verdict                                           6
3       Phantomlight                                      6
4       Bloodlord's Fetish                                5
...                                                     ...
178     Oathbreaker, Last Hope of the Breaking Storm     12
179     Wolf, Promise of the Moonwalker                   6
181     Reaper's Toll                                     5
182     Toothpick                                         3
183     Dragon's Greatsword                               3

[179 rows x 1 columns]

In [358]:
# First group
Item_group1_df = Item_group1_df.rename(columns={"Price": "Purchase Count"})
Item_group1_df

                                                      Purchase Count
Item ID Item Name
0       Splinter                                                   4
1       Crucifer                                                   4
2       Verdict                                                    6
3       Phantomlight                                               6
4       Bloodlord's Fetish                                         5
...                                                              ...
178     Oathbreaker, Last Hope of the Breaking Storm              12
179     Wolf, Promise of the Moonwalker                            6
181     Reaper's Toll                                              5
182     Toothpick                                                  3
183     Dragon's Greatsword                                        3

[179 rows x 1 columns]

In [361]:
# Performing groupby and mean function second time and keeping in a seperate dataframe
Item_group2_df = Item_df.groupby(["Item ID", "Item Name"]).mean()
Item_group2_df

                                                       Price
Item ID Item Name
0       Splinter                                      1.2800
1       Crucifer                                      2.9425
2       Verdict                                       2.4800
3       Phantomlight                                  2.4900
4       Bloodlord's Fetish                            1.7000
...                                                      ...
178     Oathbreaker, Last Hope of the Breaking Storm  4.2300
179     Wolf, Promise of the Moonwalker               4.4800
181     Reaper's Toll                                 1.6600
182     Toothpick                                     4.0300
183     Dragon's Greatsword                           1.0900

[179 rows x 1 columns]

In [362]:
# Second group
Item_group2_df = Item_group2_df.rename(columns={"Price": "Average Item Price"})
Item_group2_df

                                                      Average Item Price
Item ID Item Name
0       Splinter                                                  1.2800
1       Crucifer                                                  2.9425
2       Verdict                                                   2.4800
3       Phantomlight                                              2.4900
4       Bloodlord's Fetish                                        1.7000
...                                                                  ...
178     Oathbreaker, Last Hope of the Breaking Storm              4.2300
179     Wolf, Promise of the Moonwalker                           4.4800
181     Reaper's Toll                                             1.6600
182     Toothpick                                                 4.0300
183     Dragon's Greatsword                                       1.0900

[179 rows x 1 columns]

In [363]:
# Performing groupby and sum function second time and keeping in a seperate dataframe
Item_group3_df = Item_df.groupby(["Item ID", "Item Name"]).sum()
Item_group3_df

                                                      Price
Item ID Item Name
0       Splinter                                       5.12
1       Crucifer                                      11.77
2       Verdict                                       14.88
3       Phantomlight                                  14.94
4       Bloodlord's Fetish                             8.50
...                                                     ...
178     Oathbreaker, Last Hope of the Breaking Storm  50.76
179     Wolf, Promise of the Moonwalker               26.88
181     Reaper's Toll                                  8.30
182     Toothpick                                     12.09
183     Dragon's Greatsword                            3.27

[179 rows x 1 columns]

In [364]:
# Third group
Item_group3_df = Item_group3_df.rename(columns={"Price": "Total Purchase Value"})
Item_group3_df

                                                      Total Purchase Value
Item ID Item Name
0       Splinter                                                      5.12
1       Crucifer                                                     11.77
2       Verdict                                                      14.88
3       Phantomlight                                                 14.94
4       Bloodlord's Fetish                                            8.50
...                                                                    ...
178     Oathbreaker, Last Hope of the Breaking Storm                 50.76
179     Wolf, Promise of the Moonwalker                              26.88
181     Reaper's Toll                                                 8.30
182     Toothpick                                                    12.09
183     Dragon's Greatsword                                           3.27

[179 rows x 1 columns]

In [365]:
# Now performing the merge funtion on three dataframes
merged = df1.merge(df2, on=['Name', 'Event'])

In [383]:
# Performing the inner merge
inner_merge_item_df = pd.merge(Item_group1_df, Item_group2_df, on=["Item ID", "Item Name"])
inner_merge_item_df

,,Purchase Count,Average Item Price
Item ID,Item Name,,
0,Splinter,4,1.2800
1,Crucifer,4,2.9425
2,Verdict,6,2.4800
3,Phantomlight,6,2.4900
4,Bloodlord's Fetish,5,1.7000
...,...,...,...
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.2300
179,"Wolf, Promise of the Moonwalker",6,4.4800
181,Reaper's Toll,5,1.6600
182,Toothpick,3,4.0300
183,Dragon's Greatsword,3,1.0900

In [384]:
# Performing the inner merge
inner_merge_item1_df = pd.merge(inner_merge_item_df, Item_group3_df, on=["Item ID", "Item Name"])
inner_merge_item1_df

,,Purchase Count,Average Item Price,Total Purchase Value
Item ID,Item Name,,,
0,Splinter,4,1.2800,5.12
1,Crucifer,4,2.9425,11.77
2,Verdict,6,2.4800,14.88
3,Phantomlight,6,2.4900,14.94
4,Bloodlord's Fetish,5,1.7000,8.50
...,...,...,...,...
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.2300,50.76
179,"Wolf, Promise of the Moonwalker",6,4.4800,26.88
181,Reaper's Toll,5,1.6600,8.30
182,Toothpick,3,4.0300,12.09
183,Dragon's Greatsword,3,1.0900,3.27

In [385]:
# Sorting the values on column "Total Purchase Value" in the final dataframe
inner_merge_item1_df.sort_values('Purchase Count', ascending=False)

,,Purchase Count,Average Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77
...,...,...,...,...
42,The Decapitator,1,1.750000,1.75
51,Endbringer,1,4.660000,4.66
118,"Ghost Reaver, Longsword of Magic",1,2.170000,2.17
104,Gladiator's Glaive,1,1.930000,1.93
91,Celeste,1,4.170000,4.17

In [376]:
# Done

In [377]:
# Most Profitable Items

In [386]:
# Sorting the values on column "Total Purchase Value" in the final dataframe
inner_merge_item1_df.sort_values('Total Purchase Value', ascending=False)

,,Purchase Count,Average Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80
...,...,...,...,...
28,"Flux, Destroyer of Due Diligence",2,1.060000,2.12
125,Whistling Mithril Warblade,2,1.000000,2.00
126,Exiled Mithril Longsword,1,2.000000,2.00
104,Gladiator's Glaive,1,1.930000,1.93
42,The Decapitator,1,1.750000,1.75